# AIT580 Assignment 5 - Python/Pandas for Data Analysis
###### ---------------------------------------------------------------------------------------
##### Created by Ryan Vavra, Kevin Uruena and Lucien Wobembong (6/6/2021)
###### ---------------------------------------------------------------------------------------

#### Import Pandas package

In [2]:
import pandas as pd

#### Load CSV file and create the dataframe

In [3]:
data = pd.read_csv("C:\\Users\\Ryan\\Desktop\\EmployeeAttrition.csv")

#### 1 Count the total number of records in the table.

In [4]:
data.Age.count()

1470

#### 2 How many unique JOBROLE are there in the dataset.

In [5]:
data.JobRole.nunique()

9

#### 3 Find EMPLOYEENUMBER, EDUCATIONFIELD, JOBROLE for all the employees whose AGE is greater than equal to 50 and ATTRITION is YES.

In [6]:
data[(data.Age >= 55) & (data.Attrition == 'Yes')][['EmployeeNumber','EducationField','JobRole']]

      EmployeeNumber    EducationField                    JobRole
122              161     Life Sciences         Research Scientist
126              165           Medical  Healthcare Representative
568              787           Medical                    Manager
595              825     Life Sciences          Research Director
608              842           Medical            Sales Executive
660              918     Life Sciences      Laboratory Technician
700              977  Technical Degree         Research Scientist
966             1360           Medical     Manufacturing Director
975             1372         Marketing            Sales Executive
1354            1907     Life Sciences      Laboratory Technician
1444            2032  Technical Degree      Laboratory Technician

#### 4 For each JOBROLE, find the average MONTHLYINCOME. Arrange the output in descending order.

In [38]:
data.groupby('JobRole').MonthlyIncome.mean().sort_values(ascending=False)

JobRole
Manager                      17181.676471
Research Director            16033.550000
Healthcare Representative     7528.763359
Manufacturing Director        7295.137931
Sales Executive               6924.279141
Human Resources               4235.750000
Research Scientist            3239.972603
Laboratory Technician         3237.169884
Sales Representative          2626.000000
Name: MonthlyIncome, dtype: float64

#### 5 Count the different MARITALSTATUS when ATTRITION is YES and AGE is greater than 35 in the dataset. Arrange the count in descending order.

In [46]:
data[(data.Attrition == 'Yes') & (data.Age > 35)].groupby(data.MaritalStatus).MaritalStatus.count().sort_values(ascending=False)

MaritalStatus
Married     33
Single      30
Divorced    14
Name: MaritalStatus, dtype: int64

#### 6 For all the women employees having AGE between 55 and 60 and JOBLEVEL > 4, sort the DEPARTMENT from A to Z first and then EMPLOYEENUMBER in ascending order. Print only DEPARTMENT and EMPLOYEENUMBER in the output.

In [9]:
df = data[(data.Age > 55) & (data.Age <= 60) & (data.JobLevel > 4) & (data.Gender == 'Female')][['Department','EmployeeNumber']]

In [10]:
df.sort_values(by=['Department','EmployeeNumber'])

                  Department  EmployeeNumber
105          Human Resources             140
411   Research & Development             549
851   Research & Development            1191
1009  Research & Development            1423

#### 7 What are the correlations between Education, JobSatisfaction, and HourlyRate?

In [57]:
data[['Education','JobSatisfaction','HourlyRate']].corr()

                 Education  JobSatisfaction  HourlyRate
Education         1.000000        -0.011296    0.016775
JobSatisfaction  -0.011296         1.000000   -0.071335
HourlyRate        0.016775        -0.071335    1.000000

In [11]:
data[['Education','JobSatisfaction','HourlyRate']].corr(method = 'kendall')

                 Education  JobSatisfaction  HourlyRate
Education         1.000000        -0.004297    0.010916
JobSatisfaction  -0.004297         1.000000   -0.051780
HourlyRate        0.010916        -0.051780    1.000000

In [12]:
data[['Education','JobSatisfaction','HourlyRate']].corr(method = 'spearman')

                 Education  JobSatisfaction  HourlyRate
Education         1.000000        -0.005175    0.014432
JobSatisfaction  -0.005175         1.000000   -0.068340
HourlyRate        0.014432        -0.068340    1.000000

#### 8 What can you find from the above correlation matrix? 
##### Please write one paragraph below:

From the above correlation, we can see that none of the variables correlate strongly with each other. Per the additional
documentation regarding correlation, we would find that any correlation that falls between the range of -0.3 to +0.3 is weak.
Every single one of the correlations above falls within that range. The highest correlation is that of -0.07 for the pearson correlation matrix between HourlyRate and JobSatisfaction. Interestingly, we think most would hypothesize that these two variables would have a positive correlation if not a strong one. But they have a weak, negative correlation.